Revit 2026 API

# PointOnPlaneOffset Property

---

Signed offset from the plane.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Offset { get; set; }
```
```vb
Public Property Offset As Double
	Get
	Set
```
```cpp
public:
property double Offset {
	double get ();
	void set (double value);
}
```
```fsharp
member Offset : float with get, set
```

#### Property Value

Double

The point's position is offset in the direction of the normal vector returned by the Plane.Normal property.

#### Reference

PointOnPlane Class

Autodesk.Revit.DB Namespace